# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Focus, [3, 32, 1, 1]],  # 0: Focus layer
    [-1, 1, Conv, [32, 64, 3, 2]],  # 1: Conv layer
    [-1, 1, GhostBottleneck, [64, 3, 1]],  # 2: G-bneck layer
    [-1, 1, GhostBottleneck, [128, 3, 2]],  # 3: G-bneck layer
    [-1, 1, GhostBottleneck, [128, 3, 1]],  # 4: G-bneck layer
    [-1, 1, GhostBottleneck, [256, 3, 2]],  # 5: G-bneck layer
    [-1, 1, GhostBottleneck, [256, 3, 1]],  # 6: G-bneck layer
    [-1, 1, Conv, [512, 3, 2]],  # 7: Conv layer
    [-1, 1, SPP, [512]],  # 8: SPP layer
  ]

# YOLOv5 v6.0 head
head: [
    [2, 1, Conv, [128, 3, 1]],  # 9: Conv layer
    [4, 1, Conv, [256, 3, 1]],  # 10: Conv layer

    [[9, 10], 1, Concat, [1]], # 11: Concatenate layers 9 and 10
    [-1, 1, ASFF, [2]], # 12: ASFF_2 layer
    [11, 1, ASFF, [2]], # 13: ASFF_2 layer

    [12, 1, GhostBottleneck, [128, 3, 2]],  # 14: G-bneck layer
    [13, 1, GhostBottleneck, [256, 3, 2]],  # 15: G-bneck layer    
    [8, 1, Conv, [512, 512, 3, 1]],  # 16: Conv layer

    [[22, 25, 28], 1, Concat, [1]],  # 17: Concatenate layers 14, 15, and 16
    [-1, 1, ASFF, [3]], # 18: ASFF_3 layer
    [17, 1, ASFF, [3]], # 19: ASFF_3 layer
    [17, 1, ASFF, [3]], # 20: ASFF_3 layer
    
    [18, 1, GhostBottleneck, [128, 3, 1]],  # 21: G-bneck layer 
    [-1, 1, LADH, [3]], # 22: LADH layer
    [19, 1, GhostBottleneck, [256, 3, 1]],  # 23: G-bneck layer 
    [-1, 1, LADH, [3]], # 24: LADH layer
    [20, 1, GhostBottleneck, [512, 3, 1]],  # 25: G-bneck layer 
    [-1, 1, LADH, [3]], # 26: LADH layer

    [[22, 24, 26], 1, Detect, [nc, anchors]], # Detect(P3, P4, P5)
  ]
